; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-47)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 - object)
 (:init 
    (arm-empty)
    (clear b4)
    (on b4 b8)
    (on b8 b13)
    (on b13 b1)
    (on b1 b3)
    (on b3 b7)
    (on b7 b12)
    (on b12 b5)
    (on b5 b11)
    (on-table b11)
    (clear b6)
    (on b6 b2)
    (on-table b2)
    (clear b9)
    (on b9 b10)
    (on b10 b14)
    (on-table b14))
 (:goal (and 
(on-table b14)
(on b10 b3)
))
)

; plan
1. (unstack b4 b8)
   deleted: (on b4 b8) (clear b4) (arm-empty)
   added: (holding b4) (clear b8)
   goals met: 1 of 2
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 2
3. (unstack b8 b13)
   deleted: (on b8 b13) (clear b8) (arm-empty)
   added: (holding b8) (clear b13)
   goals met: 1 of 2
4. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 2
5. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 1 of 2
6. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 2
7. (unstack b1 b3)
   deleted: (on b1 b3) (clear b1) (arm-empty)
   added: (holding b1) (clear b3)
   goals met: 1 of 2
8. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 2
9. (unstack b9 b10)
   deleted: (on b9 b10) (clear b9) (arm-empty)
   added: (holding b9) (clear b10)
   goals met: 1 of 2
10. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 2
11. (unstack b10 b14)
   deleted: (on b10 b14) (clear b10) (arm-empty)
   added: (holding b10) (clear b14)
   goals met: 1 of 2
12. (stack b10 b3)
   deleted: (clear b3) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b3)
   goals met: 2 of 2
